recruitments/controllers/JobController.php

SELECT * FROM `job` WHERE `name` LIKE '%python%'
---
	public function actionSearch(){
		$model = new Job();
		$query=[];
		$n=0;
		//$model->load is very important to collect datas
		if ($model->load(\Yii::$app->request->post())&& $model->validate()){
			$query=Job::find()->where(['like','name',$model->name])->asArray()->all();

SELECT * FROM `job` WHERE `id`='1'
---
    public function actionView()
    {
        $id=$_GET['id'];
        $record=Job::find()->where(['id'=>$id])->asArray()->one();

SELECT * FROM `job` WHERE `id`=135
---
    public function actionAdd(){
        $model=new AddForm();
        if($model->load(\Yii::$app->request->post()) &&$model->validate()){
            //显示表单数据或者操作数据，如存入到数据库中
            $job=new Job();
            $job->saverecord($model);
            $record=Job::find()->where(['id'=>$job->id])->asArray()->one();