recruitments/models/Job.php

    public function saverecord($model){
        $this->name=$model['name'];
        $this->company=$model['company'];
        $this->city=$model['city'];
        $this->min_salary=$model['min_salary'];
        $this->max_salary=$model['max_salary'];
        $this->url=$model['url'];
        $this->technology_comment=$model['technology_comment'];
        var_dump($this->technology_comment);
        $this->publish_time=date('Y-m-d H:i:s',time());
        $this->validate();
        if($this->hasErrors()){
            echo "data is illegal!";
        }
        $this->save();
---
INSERT INTO `job` (`name`, `company`, `city`, `min_salary`, `max_salary`, `url`, `technology_comment`, `publish_time`) VALUES ('python', 'dsfjlsd', '武汉', 3000, 20000, 'www', '爱世界发达；十分骄傲', '2016-04-24 18:05:36')